app/views/comments/_comment.html.erb

<li class="comment center_block" id="comment_id">
  <h4>Comment by: <%= User.find_by(id: comment[:user_id]).name %></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]