app/controllers/api/v1/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    comment = Comment.find_by(id: request.params['id'])

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
  def index
    @comments = Comment.all.where(user_id: current_user.id)

INSERT INTO "comments" ("user_id", "body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "test_api_comment"], ["commentable_id", 1], ["commentable_type", "Image"], ["created_at", "2018-03-19 10:50:57.603180"], ["updated_at", "2018-03-19 10:50:57.603180"]]
---
  def create
    @comment = Comment.new
    @comment.body = params['body']
    @comment.user_id = current_user.id
    @comment.commentable_id = params['commentable_id'].to_i
    @comment.commentable_type = params['commentable_type']
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
  def destroy
    @comment = Comment.find_by(id: params['id_comment'])
    if @comment
      if @comment.user_id == current_user.id
        @comment.destroy