app/controllers/api/v1/images_controller.rb

  def show
    image = Image.find_by(id: request.params['id'])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    if params.key?('image')
      image_param = Hash.new(image: params['image'])
      @images = current_user.images.build(image_param[:image])
      if @images.save
---
INSERT INTO "images" ("image", "user_id", "created_at", "updated_at", "aasm_state") VALUES (?, ?, ?, ?, ?)  [["image", "index.jpeg"], ["user_id", 1], ["created_at", "2018-03-19 10:10:21.487112"], ["updated_at", "2018-03-19 10:10:21.487112"], ["aasm_state", "unverified"]]

  def upvote_like
    @image = Image.find(params['id'])
    return (response.headers['WWW-UPLOAD'] = 'Token realm=Application') && (render json: { error: 'Current user already upvoted for this picture' }, status: :unauthorized) unless @image.likes.where(user_id: current_user.id).count.zero?
    @image.likes.create(user_id: current_user.id)
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."image_id" = ? AND "likes"."user_id" = ?  [["image_id", 2], ["user_id", 1]]
INSERT INTO "likes" ("user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["image_id", 2], ["created_at", "2018-03-30 13:59:59.870163"], ["updated_at", "2018-03-30 13:59:59.870163"]]

  def downvote_like
    @image = Image.find(params['id'])
    return (response.headers['WWW-UPLOAD'] = 'Token realm=Application') && (render json: { error: 'Current user didnt voted for this picture' }, status: :unauthorized) if @image.likes.where(user_id: current_user.id).count < 1
    Like.delete(Like.where(user_id: current_user.id, image_id: @image.id))
    @image.update(likes_img: @image[:likes_img] - 1) if @image[:likes_img].positive?
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" IN (SELECT "likes"."id" FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."image_id" = ?)  [["user_id", 1], ["image_id", 1]]
UPDATE "images" SET "updated_at" = ?, "likes_img" = ? WHERE "images"."id" = ?  [["updated_at", "2018-03-30 14:04:52.497159"], ["likes_img", 0], ["id", 1]]