app/views/user/show.html.erb

<div class="row">
    <% current_user.images.each do |image| %>
---
SELECT  "images".* FROM "images" WHERE "images"."user_id" = ? ORDER BY "images"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]