app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" ORDER BY "comments"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "test"], ["commentable_id", 1], ["commentable_type", "Image"], ["created_at", "2018-03-19 09:03:03.423670"], ["updated_at", "2018-03-19 09:03:03.423670"]]
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def create
    if !params[:comment][:body].empty?
      @comment = @parent.comments.build(body: params[:comment][:body], user_id: current_user.id)
      if @comment.save
        flash[:success] = 'Comment added'
      else
        flash[:warning] = 'Comment didnt save'
      end
      redirect_to Image.find_by(id: params[:image_id]) if params[:image_id]
      redirect_to Image.find_by(id: params[:comment][:image_id]) if params[:comment][:image_id]

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = Comment.find_by(id: params[:id])
    @comment.destroy