app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @image = Image.find(params[:id])

INSERT INTO "images" ("image", "user_id", "created_at", "updated_at", "aasm_state", "tags") VALUES (?, ?, ?, ?, ?, ?)  [["image", "index.jpeg"], ["user_id", 1], ["created_at", "2018-03-30 10:24:40.201634"], ["updated_at", "2018-03-30 10:24:40.201634"], ["aasm_state", "unverified"], ["tags", "test tag"]]
---
  def create
    if params.key?(:image)
      @images = current_user.images.build(image: params[:image][:image])
      @images.title_img = params[:image][:title_img]
      @images.tags = params[:image][:tags]
      if @images.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def share
    @shareimg = Image.find(params[:id])

INSERT INTO "images" ("image", "user_id", "created_at", "updated_at", "aasm_state", "title_img") VALUES (?, ?, ?, ?, ?, ?)
---
  def create_remote
    if params.key?(:url_image)
      @images = current_user.images.build(remote_image_url: params["url_image"]["url"])
      @images.tags = params["insta_tags"].join(' ') if params["insta_tags"]
      @images.title_img = params[:text].split('#')[0] if params[:text]
      if @images.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."image_id" = ? AND "likes"."user_id" = ?  [["image_id", 1], ["user_id", 1]]
INSERT INTO "likes" ("user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["image_id", 2], ["created_at", "2018-03-30 10:51:56.737116"], ["updated_at", "2018-03-30 10:51:56.737116"]]
---
  def upvote_like
    @image = Image.find(params[:id])
    if @image.likes.where(user_id: current_user.id).count == 0
      # @image.upvote_by current_user
      # $redis.set(params[:id].to_s,@image.score)
      begin
        Redis.new.set('getstatus', 1)
        #@image.upvote_by current_user
        @image.update_attributes(likes_img: @image[:likes_img] + 1)
        @image.likes.create(user_id: current_user.id)

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" IN (SELECT "likes"."id" FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."image_id" = ?)  [["user_id", 1], ["image_id", 1]]
UPDATE "images" SET "updated_at" = ?, "likes_img" = ? WHERE "images"."id" = ?  [["updated_at", "2018-03-30 10:52:50.687499"], ["likes_img", 0], ["id", 1]]
---
  def downvote_like
    @image = Image.find(params[:id])
    if @image.likes.where(user_id: current_user.id)
      begin
        Redis.new.set('getstatus', 1)
        Like.delete(Like.where(user_id: current_user.id,image_id: @image.id))
        @image.update_attributes(likes_img: @image[:likes_img] - 1) if @image[:likes_img] > 0