app/controllers/images_controller.rb

  def upvote
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def downvote
    @image = Image.find(params[:id])
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]