app/controllers/sessions_controller.rb

  def create
    if auth_hash
      identity = Identity.where(provider: auth_hash.provider, uid: auth_hash.uid).first
      if identity
        user = User.find_by(id: identity.user_id)
        identity.update_attributes!(
          token: auth_hash.credentials.token,
          secret: auth_hash.credentials.secret,
          expires_at: expires_at
        )
      else
        user = signed_in? ? current_user_session : User.create_user(name: auth_hash.info.name, email: auth_hash.info.email)
---
SELECT  "identities".* FROM "identities" WHERE "identities"."provider" = ? AND "identities"."uid" = ? ORDER BY "identities"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "123545"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "github"], ["uid", "34962934"], ["LIMIT", 1]]
INSERT INTO "identities" ("user_id", "provider", "uid", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["provider", "facebook"], ["uid", "123545"], ["token", "dfg433f4tg45twfrthrth"], ["created_at", "2018-03-29 09:30:22.670212"], ["updated_at", "2018-03-29 09:30:22.670212"]]
INSERT INTO "users" ("name", "created_at", "updated_at", "api_token", "email") VALUES (?, ?, ?, ?, ?)  [["name", "mockuser"], ["created_at", "2018-03-29 09:30:19.368462"], ["updated_at", "2018-03-29 09:30:19.368462"], ["api_token", "r1jvroZMgFGyUr4+yi6qNI6YX0o="], ["email", "mockemail@email.cpm"]]