app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "insta_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["insta_token", nil], ["updated_at", "2018-03-30 12:01:32.449242"], ["id", 1]]
---
  def show
    @user = User.find(current_user.id)
    if !current_user.insta_token.empty?
      begin
      response = open("https://api.instagram.com/v1/users/self/media/recent/?access_token=#{current_user.insta_token}&count=12").read
      #res = open("https://api.instagram.com/v1/users/self/media/recent/?access_token=4088921481.a999fd0.64eec4699bd1882946ec2d8762e1&count=12").read
      response_parsed = JSON.parse response
      @insta_images = response_parsed["data"]
      rescue OpenURI::HTTPError
      	current_user.update_attributes(insta_token: '')

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "insta_token" = ? WHERE "users"."id" = ?  [["updated_at", "2018-03-30 11:38:46.157653"], ["insta_token", "fgfgfgfgfg"], ["id", 1]]
---
  def update
  	if !params['token_insta'].empty?
      @token = params['token_insta'].split('en=')
      @user = User.find_by(id: current_user.id)
      @user.update_attributes(insta_token: @token[1])