app/views/images/show.html.erb

  <li>
    <h4>Last comment by: <%= User.find_by(id: @image.comments.last.user_id).name %> (<%= @image.comments.last.created_at.to_formatted_s(:short) %>)</h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."image_id" = ?  [["image_id", 1]]